In [1]:
import pandas as pd 
import numpy as np

In [4]:
pop = {
    "Nevada":{2001:2.4,2002:2.9},
    "Ohio":{2000:1.5,2001:1.7,2002:3.6}
}

In [7]:
pop = pd.DataFrame(pop)
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [6]:
pop.transpose
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [8]:
frame3 = pd.DataFrame(pop)

In [9]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [13]:
pdata={"ohio":frame3["Ohio"][:-1],
      "Neveda":frame3["Nevada"][:2]
      }

In [14]:
pdata

{'ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Neveda': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [15]:
pdata = pd.DataFrame(pdata)

In [16]:
pdata

      ohio  Neveda
2000   1.5     NaN
2001   1.7     2.4

In [17]:
pdata.index.name="year"; pdata.columns.name="state"

In [18]:
pdata

state  ohio  Neveda
year
2000    1.5     NaN
2001    1.7     2.4

# index object

In [20]:
obj= pd.Series(range(3),index=["a","b","c"])

In [21]:
index=obj.index

In [22]:
index[:1]

Index(['a'], dtype='object')

# Reindexing

In [28]:
obj = pd.Series([1.1,1.2,1.3,1.4],index=["A","b","c","d"])

In [29]:
obj2 = obj.reindex(["A","b","c","d","e"])

In [30]:
obj2

A    1.1
b    1.2
c    1.3
d    1.4
e    NaN
dtype: float64

In [32]:
obj3 = obj.reindex(["A","b","c","d","e","f"],method = "ffill")# ffill mean if the next value is NAN then assign it the previous value

In [33]:
obj3

A    1.1
b    1.2
c    1.3
d    1.4
e    1.4
f    1.4
dtype: float64

In [38]:
frame = pd.DataFrame(np.arange(9).reshape (3,3),index=["a","c","d"],columns=["ohio","Nevada","Karachi"])
frame

   ohio  Nevada  Karachi
a     0       1        2
c     3       4        5
d     6       7        8

In [39]:
frame2 = frame.reindex(["a","b","c","d"])
frame2

   ohio  Nevada  Karachi
a   0.0     1.0      2.0
b   NaN     NaN      NaN
c   3.0     4.0      5.0
d   6.0     7.0      8.0